import sqlite3
conn = sqlite3.connect('Part2/zad1.db')
cur = conn.cursor()
data = {
('Рига','скорый','15:45','Рижский'),
('Ростов','фирменный','17:36','Казанский'),
('Самара','фирменный','14:20','Казанский'),
('Самара','скорый','17:40','Казанский'),
('Самара','скорый','15:56','Казанский'),
('Самара','скорый','15:56','Павелецкий'),
('Самара','фирменный','23:14','Курский'),
('Санкт-Петербург','скорый','8:00','Ленинградский'),
('Санкт-Петербург','скорый','4:00','Ленинградский'),
('Саратов','скорый','14:57','Павелецкий'),
('Саратов','пассажирский','15:58','Павелецкий'),
('Саратов', 'скорый', '15:30', 'Павелецкий')}
cur.execute("""CREATE TABLE IF NOT EXISTS data(
   'Пункт' TEXT,
   'Категория' TEXT,
   'Время' TEXT,
   'Вокзал' TEXT);
""")
cur.executemany("INSERT INTO data VALUES(?, ?, ?, ?);", data)
conn.commit()
