import sqlite3
conn = sqlite3.connect('Part2/zad2.db')
cur = conn.cursor()
data1 = {
('1588','Саенко М.А.','Ж'),
('1616','Билич А.П.','М'),
('1683','Виктюк И.Б.','М'),
('1748','Кеосаян А.И.','Ж'),
('1960','Виктюк П.И.','М'),
('1974','Тузенбах П.А.','Ж'),
('2008','Виктюк Б.Ф.','М'),
('2106','Чижик Д.К.','Ж'),
('2339','Седых Л.А.','М'),
('2349','Виктюк А.Б.','Ж'),
('2521','Меладзе К.Г.','М'),
('2593', 'Билич П.А.', 'М'),
('2730','Виктюк Т.И.','Ж'),
('2860','Панина Р.Г.','Ж'),
('2882','Шевченко Г.Р.','Ж'),
('2911', 'Седых В.А.', 'Ж')}
data2 = {
('1616','1588'),
('2349','1588'),
('2008','1683'),
('2106','1683'),
('1683','1960'),
('2882','1960'),
('2860','1974'),
('2860','2339'),
('2008','2349'),
('2106','2349'),
('1616','2593'),
('2349', '2593'),
('1683','2730'),
('2882','2730'),
('1616','2911'),
('2349', '2911')}
cur.execute("""CREATE TABLE IF NOT EXISTS data1(
   ID TEXT,
   FIO TEXT,
   GENDER TEXT);
""")
cur.execute("""CREATE TABLE IF NOT EXISTS data2(
   ID_Родителя TEXT,
   ID_Ребенка TEXT);
""")
cur.executemany("INSERT INTO data1 VALUES(?, ?, ?);", data1)
cur.executemany("INSERT INTO data2 VALUES(?, ?);", data2)
conn.commit()